app/Controllers/Accueil.php

    public function index()
    {
        $idCompte = session()->get('idCompte');

        if (! $idCompte) {
            return redirect()->to('/');
        }

        $compte = (new CompteModel())->find($idCompte);
---
SELECT *
FROM `comptes`
WHERE `comptes`.`idCompte` = 1