app/Controllers/OperationController.php

SELECT *
FROM `comptes`
WHERE `comptes`.`idCompte` = 1
---
    public function historique()
    {
        $idCompte = session()->get('idCompte');

SELECT *
FROM `comptes`
WHERE `comptes`.`idCompte` = 1
---
    private function compteConnecte()
    {
        $idCompte = session()->get('idCompte');

        if (! $idCompte) {
            return redirect()->to('/');
        }

        $compte = (new CompteModel())->find($idCompte);