app/Controllers/OperateurController.php

SELECT COUNT(*) AS `numrows`
FROM `comptes`
SELECT COUNT(*) AS `numrows`
FROM `prefixes`
WHERE `statut` = 1
---
    public function index()
    {
        $comptes     = new CompteModel();
        $historique  = new HistoriqueModel();
        $prefixes    = new PrefixeModel();

        return view('operateur/home', [
            'titre'          => 'Espace opérateur',
            'gainsTotal'     => $historique->gainsTotal(),
            'masseMonetaire' => $comptes->masseMonetaire(),
            'nbComptes'      => $comptes->countAllResults(),
            'nbPrefixes'     => $prefixes->where('statut', 1)->countAllResults(),

SELECT *
FROM `operation`
ORDER BY `idOperation` ASC
---
    public function frais()
    {
        $fraisModele = new FraisModel();
        $operations  = (new OperationModel())->orderBy('idOperation', 'ASC')->findAll();