app/Models/CompteModel.php

    public function situation(): array
    {
        return $this->select('comptes.*,
                            COUNT(historique_operation.idHistorique) AS nbOperations,
                            COALESCE(SUM(historique_operation.fraisTotal), 0) AS fraisGeneres')
                    ->join('historique_operation',
                        'historique_operation.idCompte = comptes.idCompte', 'left')
                    ->groupBy('comptes.idCompte')
                    ->orderBy('comptes.solde', 'DESC')
                    ->findAll();
---
SELECT `comptes`.*, COUNT(historique_operation.idHistorique) AS nbOperations, COALESCE(SUM(historique_operation.fraisTotal), 0) AS fraisGeneres
FROM `comptes`
LEFT JOIN `historique_operation` ON `historique_operation`.`idCompte` = `comptes`.`idCompte`
GROUP BY `comptes`.`idCompte`
ORDER BY `comptes`.`solde` DESC

    public function masseMonetaire(): float
    {
        $ligne = $this->selectSum('solde', 'total')->first();
---
SELECT SUM(`solde`) AS `total`
FROM `comptes`
 LIMIT 1