app/Models/FraisModel.php

    public function baremeDe(int $idOperation): array
    {
        return $this->where('idOperation', $idOperation)
                    ->orderBy('montantMin', 'ASC')
                    ->findAll();
---
SELECT *
FROM `frais`
WHERE `idOperation` = 3
ORDER BY `montantMin` ASC