app/Models/HistoriqueModel.php

    public function duCompte(int $idCompte): array
    {
        return $this->select('historique_operation.*, operation.type,
                              emetteur.numeroTel AS telEmetteur,
                              destinataire.numeroTel AS telDestinataire')
                    ->join('operation', 'operation.idOperation = historique_operation.idOperation')
                    ->join('comptes AS emetteur', 'emetteur.idCompte = historique_operation.idCompte')
                    ->join('comptes AS destinataire',
                           'destinataire.idCompte = historique_operation.idCompteDestinataire', 'left')
                    ->groupStart()
                        ->where('historique_operation.idCompte', $idCompte)
                        ->orWhere('historique_operation.idCompteDestinataire', $idCompte)
                    ->groupEnd()
                    ->orderBy('historique_operation.dateTransaction', 'DESC')
                    ->orderBy('historique_operation.idHistorique', 'DESC')
                    ->findAll();
---
SELECT `historique_operation`.*, `operation`.`type`, `emetteur`.`numeroTel` AS `telEmetteur`, `destinataire`.`numeroTel` AS `telDestinataire`
FROM `historique_operation`
JOIN `operation` ON `operation`.`idOperation` = `historique_operation`.`idOperation`
JOIN `comptes` AS `emetteur` ON `emetteur`.`idCompte` = `historique_operation`.`idCompte`
LEFT JOIN `comptes` AS `destinataire` ON `destinataire`.`idCompte` = `historique_operation`.`idCompteDestinataire`
WHERE   (
`historique_operation`.`idCompte` = 1
OR `historique_operation`.`idCompteDestinataire` = 1
 )
ORDER BY `historique_operation`.`dateTransaction` DESC, `historique_operation`.`idHistorique` DESC

    public function dernieres(int $limite = 10): array
    {
        return $this->select('historique_operation.*, operation.type,
                              emetteur.numeroTel AS telEmetteur,
                              destinataire.numeroTel AS telDestinataire')
                    ->join('operation', 'operation.idOperation = historique_operation.idOperation')
                    ->join('comptes AS emetteur', 'emetteur.idCompte = historique_operation.idCompte')
                    ->join('comptes AS destinataire',
                           'destinataire.idCompte = historique_operation.idCompteDestinataire', 'left')
                    ->orderBy('historique_operation.dateTransaction', 'DESC')
                    ->orderBy('historique_operation.idHistorique', 'DESC')
                    ->findAll($limite);
---
SELECT `historique_operation`.*, `operation`.`type`, `emetteur`.`numeroTel` AS `telEmetteur`, `destinataire`.`numeroTel` AS `telDestinataire`
FROM `historique_operation`
JOIN `operation` ON `operation`.`idOperation` = `historique_operation`.`idOperation`
JOIN `comptes` AS `emetteur` ON `emetteur`.`idCompte` = `historique_operation`.`idCompte`
LEFT JOIN `comptes` AS `destinataire` ON `destinataire`.`idCompte` = `historique_operation`.`idCompteDestinataire`
ORDER BY `historique_operation`.`dateTransaction` DESC, `historique_operation`.`idHistorique` DESC
 LIMIT 8