app/Models/PrefixeModel.php

    public function tous(): array
    {
        return $this->orderBy('statut', 'DESC')
                    ->orderBy('valeur', 'ASC')
                    ->findAll();
---
SELECT *
FROM `prefixes`
ORDER BY `statut` DESC, `valeur` ASC